Posts/Post2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-17 Sun 20:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thesis Planning</title>
<meta name="author" content="Maxwell Morris" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Thesis Planning</h1>
<p>
I know I am not a great writer but I do intend to become better. It is my intention that for the next year as I work on my honours thesis I will continually post my work and progress on this website as a way to keep myself in check and improve my writing. I am not sure how other people go about there research work but for me I think me maintaining this website will be good for me.
</p>

<p>
Questions going forward?
<span class="timestamp-wrapper"><span class="timestamp">[2022-07-17 Sun]</span></span>
How should I format my posts?
</p>

<p>
How many posts should I do a week?
</p>

<p>
What I am doing my thesis on?
</p>

<p>
How will I balance work, coursework and relationships?
</p>

<p>
What should my deadlines be (Gantt chart for thesis)?
</p>

<p>
What makes for a good thesis?
</p>

<p>
What are my current ideas for a thesis and what can I acheive in researching these topics?
</p>



<p>
How am I feeling about life?
<span class="timestamp-wrapper"><span class="timestamp">[2022-07-17 Sun]</span></span>
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Maxwell Morris</p>
<p class="date">Created: 2022-07-17 Sun 20:16</p>
</div>
</body>
</html>
